src/InformationRegisters/EMS_КодСопоставленияОрганизации/EMS_КодСопоставленияОрганизации.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>EMS_КодСопоставленияОрганизации</name>
  <resources>
    <name>ГУИД</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Code</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/Catalogs/EMS_ПараметрыБаз/EMS_ПараметрыБаз.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>EMS_ПараметрыБаз</name>
  <attributes>
    <name>Proxy</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>SSL</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>WSИмяБазы</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>WSИмяСервера</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КодОрганизации</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеУзлаИБ</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

src/CommonModules/EMS_Express/Module.bsl
#Область ПрограммныйИнтерфейс

// Обрабатывает команды, полученные от eXpress.
// Для команд, которым нужны данные нижних баз, выполняет запрос к соответствующей базе EMS.
//
// Параметры:
//  ИдентификаторБота - Строка
//      Идентификатор бота eXpress.
//  ИдентификаторЧата - Строка
//      Идентификатор чата eXpress, из которого получена команда.
//  ИдентификаторПользователя - Строка
//      HUID пользователя eXpress, отправившего команду.
//  ИмяКоманды - Строка
//      Тело команды eXpress.
//  sync_id - Строка
//      Идентификатор синхронизации входящего запроса eXpress.
//  ТипКоманды - Строка
//      Тип входящей команды eXpress: user или system.
//
Процедура ОбработатьКомандыExpress(Знач ИдентификаторБота, Знач ИдентификаторЧата,
	Знач ИдентификаторПользователя, Знач ИмяКоманды, Знач sync_id, Знач ТипКоманды = "user") Экспорт
	Если ЗначениеЗаполнено(ТипКоманды) И НРег(СокрЛП(ТипКоманды)) <> "user" Тогда
		Возврат;
	КонецЕсли;
	ИмяКомандыОбработки = СокрЛП(ИмяКоманды);
	Попытка
		СценарийИзменен = УдалитьСостояниеВводаФамилииПриСменеСценарияExpress(
			ИдентификаторЧата, ИмяКоманды);
		Если Не СценарийИзменен И Не ЭтоКомандаПоискаСотрудникаExpress(ИмяКоманды) Тогда
			Если Не ОжидаетсяВводФамилииСотрудникаExpress(ИдентификаторБота, ИдентификаторЧата) Тогда
				ОтправитьСообщениеКомандыExpress(
					ИдентификаторБота, ИдентификаторЧата, "Выберите команду.",
					Неопределено, sync_id, КомандаПоискаСотрудникаExpress());
				Возврат;
			КонецЕсли;
			ИмяКомандыОбработки = СтрШаблон("%1 %2", КомандаПоискаСотрудникаExpress(), ИмяКомандыОбработки);
		КонецЕсли;
		ЗаписатьЛогКомандыExpress(
			"Начало", ИмяКомандыОбработки, sync_id, ИдентификаторЧата, ИдентификаторБота, "Начало обработки команды");
		Если ЭтоКомандаПоискаСотрудникаExpress(ИмяКомандыОбработки) Тогда
			ОбработатьКомандуПоискаСотрудникаExpress(
				ИдентификаторБота, ИдентификаторЧата, ИдентификаторПользователя, ИмяКомандыОбработки, sync_id);
		ИначеЕсли ЭтоКомандаКалендаряОтпускаExpress(ИмяКомандыОбработки) Тогда
			ОбработатьКомандуКалендаряОтпускаExpress(
				ИдентификаторБота, ИдентификаторЧата, ИмяКомандыОбработки, sync_id);
		Иначе
			ОбработатьКомандуОстаткаОтпускаExpress(
				ИдентификаторБота, ИдентификаторЧата, ИмяКомандыОбработки, sync_id);
		КонецЕсли;
		ЗаписатьЛогКомандыExpress(
			"Конец", ИмяКомандыОбработки, sync_id, ИдентификаторЧата, ИдентификаторБота, "Команда обработана");
	Исключение
		ТекстОшибки = ОписаниеОшибки();
		ЗаписатьЛогКомандыExpress(
			"Ошибка", ИмяКомандыОбработки, sync_id, ИдентификаторЧата, ИдентификаторБота, ТекстОшибки,
			УровеньЖурналаРегистрации.Ошибка);
		ОповеститьПользователяОбОшибкеКомандыExpress(
			ИдентификаторБота, ИдентификаторЧата, ИмяКомандыОбработки, sync_id, ТекстОшибки);
	КонецПопытки;
КонецПроцедуры
#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ОповеститьПользователяОбОшибкеКомандыExpress(Знач ИдентификаторБота, Знач ИдентификаторЧата,
	Знач ИмяКоманды, Знач ИдентификаторСинхронизации, Знач ТекстИсходнойОшибки)
	Попытка
		ОтправитьСообщениеКомандыExpress(
			ИдентификаторБота, ИдентификаторЧата,
			"При выполнении команды произошла ошибка. Попробуйте еще раз или выберите другую команду.",
			Неопределено, ИдентификаторСинхронизации, ИмяКоманды);
	Исключение
		ЗаписатьЛогКомандыExpress(
			"ОшибкаОповещения", ИмяКоманды, ИдентификаторСинхронизации, ИдентификаторЧата, ИдентификаторБота,
			СтрШаблон("Исходная ошибка: %1; ошибка оповещения: %2", ТекстИсходнойОшибки, ОписаниеОшибки()),
			УровеньЖурналаРегистрации.Ошибка);
	КонецПопытки;
КонецПроцедуры

Процедура ОбработатьКомандуПоискаСотрудникаExpress(Знач ИдентификаторБота, Знач ИдентификаторЧата,
	Знач ИдентификаторПользователя, Знач ИмяКоманды, Знач ИдентификаторСинхронизации)
	Если Не КомандаПоискаСотрудникаДоступнаПользователю(ИдентификаторБота, ИдентификаторПользователя) Тогда
		УдалитьСостояниеВводаФамилииСотрудникаExpress(ИдентификаторЧата);
		ОтправитьСообщениеКомандыExpress(
			ИдентификаторБота, ИдентификаторЧата, "Команда /Employee не подключена в этом чате.",
			Неопределено, ИдентификаторСинхронизации, ИмяКоманды);
		Возврат;
	КонецЕсли;
	Фамилия = ФамилияИзКомандыПоискаСотрудника(ИмяКоманды);
	Если ПустаяСтрока(Фамилия) Тогда
		ЗаписатьСостояниеВводаФамилииСотрудникаExpress(
			ИдентификаторБота, ИдентификаторЧата, ИдентификаторСинхронизации);
		ОтправитьСообщениеКомандыExpress(
			ИдентификаторБота, ИдентификаторЧата, "Введите фамилию сотрудника.",
			Неопределено, ИдентификаторСинхронизации, ИмяКоманды);
		Возврат;
	КонецЕсли;
	УдалитьСостояниеВводаФамилииСотрудникаExpress(ИдентификаторЧата);
	РезультатПоиска = ZUPC_ПоискСотрудниковExpress.НайтиСотрудниковПоФамилии(Фамилия);
	Если РезультатПоиска.Сотрудники.Количество() = 0 Тогда
		ОтправитьСообщениеКомандыExpress(
			ИдентификаторБота, ИдентификаторЧата, СтрШаблон("Сотрудники по фамилии «%1» не найдены.", Фамилия),
			Неопределено, ИдентификаторСинхронизации, ИмяКоманды);
		Возврат;
	КонецЕсли;
	Сообщения = СформироватьСообщенияПоискаСотрудников(Фамилия, РезультатПоиска);
	Для Каждого ТекстСообщения Из Сообщения Цикл
		ОтправитьСообщениеКомандыExpress(
			ИдентификаторБота, ИдентификаторЧата, ТекстСообщения,
			Неопределено, ИдентификаторСинхронизации, ИмяКоманды);
	КонецЦикла;
КонецПроцедуры

Функция КомандаПоискаСотрудникаДоступнаПользователю(Знач ИдентификаторБота, Знач ИдентификаторПользователя)
	Если Не ЗначениеЗаполнено(ИдентификаторПользователя) Тогда
		Возврат Ложь;
	КонецЕсли;
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ЧатыКоманды.Тело КАК Тело
		|ИЗ
		|	Справочник.Чаты.Команды КАК ЧатыКоманды
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Чаты.Участники КАК ЧатыУчастники
		|		ПО ЧатыКоманды.Ссылка = ЧатыУчастники.Ссылка
		|ГДЕ
		|	НЕ ЧатыКоманды.Ссылка.ПометкаУдаления
		|	И ЧатыКоманды.Ссылка.Бот.BotID = &ИдентификаторБота
		|	И ЧатыКоманды.Ссылка.ТипЧата = ЗНАЧЕНИЕ(Перечисление.RSN_ТипыЧатов.chat)
		|	И ЧатыУчастники.Huid = &ИдентификаторПользователя
		|	И ЧатыКоманды.Вид В (
		|			ЗНАЧЕНИЕ(Перечисление.RSN_ВидыКомандЧата.command),
		|			ЗНАЧЕНИЕ(Перечисление.RSN_ВидыКомандЧата.bubble),
		|			ЗНАЧЕНИЕ(Перечисление.RSN_ВидыКомандЧата.keyboard))
		|	И ЧатыКоманды.Использовать
		|	И ЧатыКоманды.Тело <> """"";
	Запрос.УстановитьПараметр("ИдентификаторБота", ИдентификаторБота);
	Запрос.УстановитьПараметр("ИдентификаторПользователя", ИдентификаторПользователя);
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Если ЭтоКомандаПоискаСотрудникаExpress(Выборка.Тело) Тогда
			Возврат Истина;
		КонецЕсли;
	КонецЦикла;
	Возврат Ложь;
КонецФункции

Функция УдалитьСостояниеВводаФамилииПриСменеСценарияExpress(Знач ИдентификаторЧата, Знач ИмяКоманды)
	СценарийИзменен = ЭтоКомандаОтпускаExpress(ИмяКоманды)
		Или ЭтоКомандаКалендаряОтпускаExpress(ИмяКоманды);
	Если СценарийИзменен Тогда
		УдалитьСостояниеВводаФамилииСотрудникаExpress(ИдентификаторЧата);
	КонецЕсли;
	Возврат СценарийИзменен;
КонецФункции

Процедура ЗаписатьСостояниеВводаФамилииСотрудникаExpress(Знач ИдентификаторБота, Знач ИдентификаторЧата,
	Знач ИдентификаторСинхронизации)
	НаборЗаписей = НаборЗаписейСостоянияВводаФамилииСотрудникаExpress(ИдентификаторЧата);
	НаборЗаписей.Прочитать();
	НаборЗаписей.Очистить();
	Запись = НаборЗаписей.Добавить();
	Запись.ИдентификаторЧата = ИдентификаторЧата;
	Запись.Сценарий = СценарийПоискаСотрудникаExpress();
	Запись.ИдентификаторБота = ИдентификаторБота;
	Запись.Шаг = ШагВводаФамилииСотрудникаExpress();
	Запись.ДатаСоздания = ТекущаяДатаСеанса();
	Запись.ДатаОбновления = ТекущаяДатаСеанса();
	Запись.SyncId = ИдентификаторСинхронизации;
	НаборЗаписей.Записать(Истина);
КонецПроцедуры

Процедура УдалитьСостояниеВводаФамилииСотрудникаExpress(Знач ИдентификаторЧата)
	НаборЗаписей = НаборЗаписейСостоянияВводаФамилииСотрудникаExpress(ИдентификаторЧата);
	НаборЗаписей.Прочитать();
	Если НаборЗаписей.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	НаборЗаписей.Очистить();
	НаборЗаписей.Записать(Истина);
КонецПроцедуры

Функция НаборЗаписейСостоянияВводаФамилииСотрудникаExpress(Знач ИдентификаторЧата)
	НаборЗаписей = РегистрыСведений.RSN_СостоянияСценариевExpress.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.ИдентификаторЧата.Установить(ИдентификаторЧата);
	НаборЗаписей.Отбор.Сценарий.Установить(СценарийПоискаСотрудникаExpress());
	Возврат НаборЗаписей;
КонецФункции

Функция ОжидаетсяВводФамилииСотрудникаExpress(Знач ИдентификаторБота, Знач ИдентификаторЧата)
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	СостоянияСценариевExpress.ИдентификаторБота КАК ИдентификаторБота,
		|	СостоянияСценариевExpress.Шаг КАК Шаг,
		|	СостоянияСценариевExpress.ДатаОбновления КАК ДатаОбновления
		|ИЗ
		|	РегистрСведений.RSN_СостоянияСценариевExpress КАК СостоянияСценариевExpress
		|ГДЕ
		|	СостоянияСценариевExpress.ИдентификаторЧата = &ИдентификаторЧата
		|	И СостоянияСценариевExpress.Сценарий = &Сценарий";
	Запрос.УстановитьПараметр("ИдентификаторЧата", ИдентификаторЧата);
	Запрос.УстановитьПараметр("Сценарий", СценарийПоискаСотрудникаExpress());
	Выборка = Запрос.Выполнить().Выбрать();
	Если Не Выборка.Следующий() Тогда
		Возврат Ложь;
	КонецЕсли;
	СостояниеАктуально = Выборка.ИдентификаторБота = ИдентификаторБота
		И Выборка.Шаг = ШагВводаФамилииСотрудникаExpress()
		И Выборка.ДатаОбновления >= ТекущаяДатаСеанса() - СрокОжиданияВводаФамилииСотрудникаExpress();
	Если Не СостояниеАктуально Тогда
		УдалитьСостояниеВводаФамилииСотрудникаExpress(ИдентификаторЧата);
	КонецЕсли;
	Возврат СостояниеАктуально;
КонецФункции

Функция СформироватьСообщенияПоискаСотрудников(Знач Фамилия, Знач РезультатПоиска)
	Сообщения = Новый Массив;
	Заголовок = СтрШаблон("Найдены сотрудники: %1", РезультатПоиска.Сотрудники.Количество());
	Если РезультатПоиска.НечеткийПоиск Тогда
		Заголовок = СтрШаблон(
			"По фамилии «%1» точных совпадений нет. Показаны похожие: %2.%3Найдены сотрудники: %4",
			Фамилия,
			НРег(РезультатПоиска.НайденнаяФамилия),
			Символы.ПС,
			РезультатПоиска.Сотрудники.Количество());
	КонецЕсли;
	ТекстСообщения = Заголовок;
	НомерВСообщении = 0;
	Для Каждого ДанныеСотрудника Из РезультатПоиска.Сотрудники Цикл
		Если НомерВСообщении = 15 Тогда
			Сообщения.Добавить(ТекстСообщения);
			ТекстСообщения = "Продолжение списка сотрудников:";
			НомерВСообщении = 0;
		КонецЕсли;
		ТекстСообщения = СтрШаблон(
			"%1%2%2%3", ТекстСообщения, Символы.ПС, ПредставлениеСотрудникаExpress(ДанныеСотрудника));
		НомерВСообщении = НомерВСообщении + 1;
	КонецЦикла;
	Сообщения.Добавить(ТекстСообщения);
	Возврат Сообщения;
КонецФункции

Функция ПредставлениеСотрудникаExpress(Знач ДанныеСотрудника)
	ДатаРождения = ?(
		ЗначениеЗаполнено(ДанныеСотрудника.ДатаРождения),
		Формат(ДанныеСотрудника.ДатаРождения, "ДФ='dd.MM.yyyy'"),
		"не указана");
	Должность = ?(ЗначениеЗаполнено(ДанныеСотрудника.Должность), Строка(ДанныеСотрудника.Должность), "не указана");
	Статус = ДанныеСотрудника.Статус;
	Если Статус = "уволен" И ЗначениеЗаполнено(ДанныеСотрудника.ДатаУвольнения) Тогда
		Статус = СтрШаблон("%1 %2", Статус, Формат(ДанныеСотрудника.ДатаУвольнения, "ДФ='dd.MM.yyyy'"));
	КонецЕсли;
	Возврат СтрШаблон(
		"%1%2Дата рождения: %3%2Должность: %4%2Статус: %5",
		ДанныеСотрудника.ФИО, Символы.ПС, ДатаРождения, Должность, Статус);
КонецФункции

Функция ФамилияИзКомандыПоискаСотрудника(Знач ИмяКоманды)
	Возврат СокрЛП(Сред(СокрЛП(ИмяКоманды), СтрДлина(КомандаПоискаСотрудникаExpress()) + 1));
КонецФункции

Процедура ОбработатьКомандуОстаткаОтпускаExpress(Знач ИдентификаторБота, Знач ИдентификаторЧата,
	Знач ИмяКоманды, Знач ИдентификаторСинхронизации)
	ДатаОстатка = ДатаИзКомандыОтпускаExpress(ИмяКоманды);
	Если ДатаОстатка = Неопределено Тогда
		ОткрытьКалендарьОтпускаExpress(ИдентификаторБота, ИдентификаторЧата, ИдентификаторСинхронизации);
		Возврат;
	КонецЕсли;
	ОтправитьОстатокОтпускаExpress(
		ИдентификаторБота, ИдентификаторЧата, ИдентификаторСинхронизации, ДатаОстатка);
КонецПроцедуры

Процедура ОткрытьКалендарьОтпускаExpress(Знач ИдентификаторБота, Знач ИдентификаторЧата,
	Знач ИдентификаторСинхронизации)
	ДатаПозиции = НачалоДня(ТекущаяДатаСеанса());
	ЗаписатьСостояниеВыбораДатыОтпускаExpress(
		ИдентификаторБота, ИдентификаторЧата, ДатаПозиции, КомандаОтпускаExpress(), ИдентификаторСинхронизации);
	КнопкиКалендаря = RSN_eXpress.СформироватьКнопкиКалендаряExpress(
		ДатаПозиции, ПрефиксКомандыКалендаряОтпускаExpress());
	ТекстСообщения = СтрШаблон("Выберите дату для расчета остатка отпуска (%1).",
		Формат(ДатаПозиции, "ДФ='MMMM yyyy'"));
	ОтправитьСообщениеКомандыExpress(
		ИдентификаторБота, ИдентификаторЧата, ТекстСообщения, КнопкиКалендаря, ИдентификаторСинхронизации,
		КомандаОтпускаExpress());
КонецПроцедуры

Процедура ОбработатьКомандуКалендаряОтпускаExpress(Знач ИдентификаторБота, Знач ИдентификаторЧата,
	Знач ИмяКоманды, Знач ИдентификаторСинхронизации)
	ДанныеКоманды = RSN_eXpress.РазобратьКомандуКалендаряExpress(
		ИмяКоманды, ПрефиксКомандыКалендаряОтпускаExpress());
	Если ДанныеКоманды.Действие = "noop" Тогда
		Возврат;
	КонецЕсли;
	Если ДанныеКоманды.Действие = "cancel" Тогда
		УдалитьСостояниеВыбораДатыОтпускаExpress(ИдентификаторЧата);
		ОтправитьСообщениеКомандыExpress(
			ИдентификаторБота, ИдентификаторЧата, "Выбор даты отменен.", Неопределено, ИдентификаторСинхронизации,
			ИмяКоманды);
		Возврат;
	КонецЕсли;
	СостояниеВыбора = ПолучитьСостояниеВыбораДатыОтпускаExpress(ИдентификаторЧата);
	Если СостояниеВыбора = Неопределено Тогда
		ОтправитьСообщениеКомандыExpress(
			ИдентификаторБота, ИдентификаторЧата, "Выбор даты устарел. Отправьте /VacationDays еще раз.",
			Неопределено, ИдентификаторСинхронизации, ИмяКоманды);
		Возврат;
	КонецЕсли;
	Если ДанныеКоманды.Действие = "month" Тогда
		ОбновитьМесяцКалендаряОтпускаExpress(
			ИдентификаторБота, ИдентификаторЧата, ДанныеКоманды.ДатаПозиции, ИдентификаторСинхронизации);
		Возврат;
	КонецЕсли;
	Если ДанныеКоманды.Действие = "date" Или ДанныеКоманды.Действие = "today" Тогда
		УдалитьСостояниеВыбораДатыОтпускаExpress(ИдентификаторЧата);
		ОтправитьОстатокОтпускаExpress(
			ИдентификаторБота, ИдентификаторЧата, ИдентификаторСинхронизации, ДанныеКоманды.Дата);
	КонецЕсли;
КонецПроцедуры

Процедура ОбновитьМесяцКалендаряОтпускаExpress(Знач ИдентификаторБота, Знач ИдентификаторЧата,
	Знач ДатаПозиции, Знач ИдентификаторСинхронизации)
	ЗаписатьСостояниеВыбораДатыОтпускаExpress(
		ИдентификаторБота, ИдентификаторЧата, ДатаПозиции, КомандаОтпускаExpress(), ИдентификаторСинхронизации);
	КнопкиКалендаря = RSN_eXpress.СформироватьКнопкиКалендаряExpress(
		ДатаПозиции, ПрефиксКомандыКалендаряОтпускаExpress());
	ТекстСообщения = СтрШаблон("Выберите дату для расчета остатка отпуска (%1).",
		Формат(ДатаПозиции, "ДФ='MMMM yyyy'"));
	ОтправитьСообщениеКомандыExpress(
		ИдентификаторБота, ИдентификаторЧата, ТекстСообщения, КнопкиКалендаря, ИдентификаторСинхронизации,
		ПрефиксКомандыКалендаряОтпускаExpress());
КонецПроцедуры

Процедура ОтправитьОстатокОтпускаExpress(Знач ИдентификаторБота, Знач ИдентификаторЧата,
	Знач ИдентификаторСинхронизации, Знач ДатаОстатка)
	ЭлектроннаяПочта = RSN_eXpress.ЭлектроннаяПочтаПоИдентификаторуЧата(ИдентификаторЧата);
	Сотрудник = РегистрыСведений.ZUPC_НовыеCотрудники.СотрудникПоЭлектроннойПочте(ЭлектроннаяПочта);
	ДанныеОтпуска = ПолучитьДанныеОтпускаИзНижнейБазы(
		Сотрудник, КомандаОтпускаExpress(), ИдентификаторСинхронизации, ДатаОстатка);
	ДанныеЧата = RSN_eXpress.ДанныеЧата(ИдентификаторЧата);
	КнопкиExpress = RSN_eXpress.ПолучитьКнопкиЧата(ДанныеЧата.Чат);
	ТекстСообщения = СтрШаблон(
		"Остаток дней отпуска на %1: %2", Формат(ДатаОстатка, "ДФ='dd.MM.yyyy'"), ДанныеОтпуска.ОстатокНаДату);
	ОтправитьСообщениеКомандыExpress(
		ИдентификаторБота, ИдентификаторЧата, ТекстСообщения, КнопкиExpress, ИдентификаторСинхронизации,
		КомандаОтпускаExpress());
КонецПроцедуры

Процедура ОтправитьСообщениеКомандыExpress(Знач ИдентификаторБота, Знач ИдентификаторЧата,
	Знач ТекстСообщения, Знач КнопкиExpress, Знач ИдентификаторСинхронизации, Знач ИмяКоманды)
	ДанныеБота = RSN_eXpress.ДанныеБота(ИдентификаторБота);
	Соединение = Новый HTTPСоединение(
		ДанныеБота.BaseURL, , , , , ДанныеБота.Timeout, Новый ЗащищенноеСоединениеOpenSSL());
	Токен = RSN_eXpress.ТокенБота(Соединение, ДанныеБота);
	КнопкиСообщенияExpress = ПолучитьКнопкиСообщенияExpress(ИдентификаторЧата, КнопкиExpress);
	ИмяСобытияЖурнала = СобытиеЖурналаКомандыОтпускаExpress(ИмяКоманды);
	ОписаниеКоманды = СтрШаблон("command=%1", ИмяКоманды);
	RSN_eXpress.ЗаписатьВЖурналИсходящееСообщениеExpress(УровеньЖурналаРегистрации.Информация,
		"Команда", ИмяСобытияЖурнала, ИдентификаторСинхронизации, ИдентификаторЧата, ТекстСообщения, 0, "",
		КнопкиExpressЗаполнены(КнопкиСообщенияExpress), ДанныеБота.BotID, ОписаниеКоманды);
	RSN_eXpress.ОтправитьСообщениеВExpress(
		Соединение, Токен, ИдентификаторЧата, ТекстСообщения, КнопкиСообщенияExpress, ДанныеБота.BotID);
КонецПроцедуры

Процедура ЗаписатьСостояниеВыбораДатыОтпускаExpress(Знач ИдентификаторБота, Знач ИдентификаторЧата,
	Знач ДатаПозиции, Знач КомандаРезультата, Знач ИдентификаторСинхронизации)
	НаборЗаписей = НаборЗаписейСостоянияВыбораДатыОтпускаExpress(ИдентификаторЧата);
	НаборЗаписей.Прочитать();
	НаборЗаписей.Очистить();
	Запись = НаборЗаписей.Добавить();
	Запись.ИдентификаторЧата = ИдентификаторЧата;
	Запись.Сценарий = СценарийВыбораДатыОтпускаExpress();
	Запись.ИдентификаторБота = ИдентификаторБота;
	Запись.Шаг = ШагВыбораДатыОтпускаExpress();
	ДанныеСценария = Новый Структура("ДатаПозиции, КомандаРезультата", НачалоМесяца(ДатаПозиции), КомандаРезультата);
	Запись.ДанныеСценария = Новый ХранилищеЗначения(ДанныеСценария);
	Запись.ДатаСоздания = ТекущаяДатаСеанса();
	Запись.ДатаОбновления = ТекущаяДатаСеанса();
	Запись.SyncId = ИдентификаторСинхронизации;
	НаборЗаписей.Записать(Истина);
КонецПроцедуры

Процедура УдалитьСостояниеВыбораДатыОтпускаExpress(Знач ИдентификаторЧата)
	НаборЗаписей = НаборЗаписейСостоянияВыбораДатыОтпускаExpress(ИдентификаторЧата);
	НаборЗаписей.Прочитать();
	НаборЗаписей.Очистить();
	НаборЗаписей.Записать(Истина);
КонецПроцедуры

Функция НаборЗаписейСостоянияВыбораДатыОтпускаExpress(Знач ИдентификаторЧата)
	НаборЗаписей = РегистрыСведений.RSN_СостоянияСценариевExpress.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.ИдентификаторЧата.Установить(ИдентификаторЧата);
	НаборЗаписей.Отбор.Сценарий.Установить(СценарийВыбораДатыОтпускаExpress());
	Возврат НаборЗаписей;
КонецФункции

Функция ПолучитьСостояниеВыбораДатыОтпускаExpress(Знач ИдентификаторЧата)
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	СостоянияСценариевExpress.ИдентификаторБота КАК ИдентификаторБота,
		|	СостоянияСценариевExpress.Шаг КАК Шаг,
		|	СостоянияСценариевExpress.ДанныеСценария КАК ДанныеСценария,
		|	СостоянияСценариевExpress.SyncId КАК SyncId
		|ИЗ
		|	РегистрСведений.RSN_СостоянияСценариевExpress КАК СостоянияСценариевExpress
		|ГДЕ
		|	СостоянияСценариевExpress.ИдентификаторЧата = &ИдентификаторЧата
		|	И СостоянияСценариевExpress.Сценарий = &Сценарий";
	Запрос.УстановитьПараметр("ИдентификаторЧата", ИдентификаторЧата);
	Запрос.УстановитьПараметр("Сценарий", СценарийВыбораДатыОтпускаExpress());
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Результат = Новый Структура("ИдентификаторБота, Шаг, ДанныеСценария, SyncId");
		Результат.ИдентификаторБота = Выборка.ИдентификаторБота;
		Результат.Шаг = Выборка.Шаг;
		Результат.ДанныеСценария = Выборка.ДанныеСценария;
		Результат.SyncId = Выборка.SyncId;
		Возврат Результат;
	КонецЕсли;
	Возврат Неопределено;
КонецФункции

Функция ПолучитьДанныеОтпускаИзНижнейБазы(Знач Сотрудник, Знач ИмяКоманды, Знач ИдентификаторСинхронизации,
	Знач ДатаОстатка = Неопределено)
	Если Не ЗначениеЗаполнено(Сотрудник) Тогда
		ВызватьИсключение "Не определен сотрудник для запроса остатка отпуска.";
	КонецЕсли;
	ПараметрыБазы = ПараметрыБазыПоСотруднику(Сотрудник);
	ДанныеЗапроса = Новый Структура;
	ДанныеЗапроса.Вставить("ИмяКоманды", ИмяКоманды);
	ДанныеЗапроса.Вставить("ИдентификаторСотрудника", Строка(Сотрудник.УникальныйИдентификатор()));
	ДанныеЗапроса.Вставить("sync_id", ИдентификаторСинхронизации);
	Если ДатаОстатка <> Неопределено Тогда
		ДанныеЗапроса.Вставить("ДатаОстатка", ДатаОстатка);
	КонецЕсли;
	ОтветНижнейБазы = ВыполнитьЗапросДанныхExpress(ПараметрыБазы, ДанныеЗапроса);
	ДанныеОтвета = ОтветНижнейБазы.ДанныеОтвета;
	Если Не ДанныеОтвета.Свойство("result")
		Или ТипЗнч(ДанныеОтвета.result) <> Тип("Структура") Тогда
		ВызватьИсключение "Нижняя база вернула ответ без данных результата.";
	КонецЕсли;
	Если Не ДанныеОтвета.result.Свойство("ОстатокНаДату") Тогда
		ВызватьИсключение "Нижняя база вернула ответ без остатка отпуска.";
	КонецЕсли;
	Возврат Новый Структура("ОстатокНаДату", ДанныеОтвета.result.ОстатокНаДату);
КонецФункции

Функция ЭтоКомандаОтпускаExpress(Знач ИмяКоманды)
	Команда = СокрЛП(ИмяКоманды);
	Возврат Команда = КомандаОтпускаExpress()
		Или СтрНачинаетсяС(Команда, КомандаОтпускаExpress() + " ");
КонецФункции

Функция ЭтоКомандаПоискаСотрудникаExpress(Знач ИмяКоманды)
	Команда = НРег(СокрЛП(ИмяКоманды));
	КомандаПоиска = НРег(КомандаПоискаСотрудникаExpress());
	Возврат Команда = КомандаПоиска
		Или СтрНачинаетсяС(Команда, КомандаПоиска + " ");
КонецФункции

Функция ЭтоКомандаКалендаряОтпускаExpress(Знач ИмяКоманды)
	Возврат RSN_eXpress.ЭтоКомандаКалендаряExpress(ИмяКоманды, ПрефиксКомандыКалендаряОтпускаExpress());
КонецФункции

Функция ДатаИзКомандыОтпускаExpress(Знач ИмяКоманды)
	ЧастиКоманды = СтрРазделить(СокрЛП(ИмяКоманды), " ", Ложь);
	Если ЧастиКоманды.Количество() < 2 Тогда
		Возврат Неопределено;
	КонецЕсли;
	Возврат ДатаИзСтрокиКомандыОтпускаExpress(ЧастиКоманды[1]);
КонецФункции

Функция ДатаИзСтрокиКомандыОтпускаExpress(Знач СтрокаДаты)
	Если СтрНайти(СтрокаДаты, "-") > 0 Тогда
		ЧастиДаты = СтрРазделить(СтрокаДаты, "-", Ложь);
		Если ЧастиДаты.Количество() = 3 Тогда
			Возврат Дата(Число(ЧастиДаты[0]), Число(ЧастиДаты[1]), Число(ЧастиДаты[2]));
		КонецЕсли;
	КонецЕсли;
	Если СтрНайти(СтрокаДаты, ".") > 0 Тогда
		ЧастиДаты = СтрРазделить(СтрокаДаты, ".", Ложь);
		Если ЧастиДаты.Количество() = 3 Тогда
			Возврат Дата(Число(ЧастиДаты[2]), Число(ЧастиДаты[1]), Число(ЧастиДаты[0]));
		КонецЕсли;
	КонецЕсли;
	ВызватьИсключение СтрШаблон(
		"Некорректная дата '%1'. Используйте формат ДД.ММ.ГГГГ или ГГГГ-ММ-ДД.", СтрокаДаты);
КонецФункции

Функция КнопкиExpressЗаполнены(Знач КнопкиExpress)
	Если КнопкиExpress = Неопределено Или ТипЗнч(КнопкиExpress) <> Тип("Структура") Тогда
		Возврат Ложь;
	КонецЕсли;
	Bubble = Неопределено;
	Keyboard = Неопределено;
	ЕстьBubble = Ложь;
	ЕстьKeyboard = Ложь;
	Если КнопкиExpress.Свойство("bubble", Bubble) И Bubble <> Неопределено Тогда
		ЕстьBubble = Bubble.Количество() > 0;
	КонецЕсли;
	Если КнопкиExpress.Свойство("keyboard", Keyboard) И Keyboard <> Неопределено Тогда
		ЕстьKeyboard = Keyboard.Количество() > 0;
	КонецЕсли;
	Возврат ЕстьBubble Или ЕстьKeyboard;
КонецФункции

Функция ПолучитьКнопкиСообщенияExpress(Знач ИдентификаторЧата, Знач КнопкиExpress)
	Если КнопкиExpressЗаполнены(КнопкиExpress) Тогда
		Возврат КнопкиExpress;
	КонецЕсли;
	ДанныеЧата = RSN_eXpress.ДанныеЧата(ИдентификаторЧата);
	Возврат RSN_eXpress.ПолучитьКнопкиЧата(ДанныеЧата.Чат);
КонецФункции

Функция СобытиеЖурналаКомандыОтпускаExpress(Знач ИмяКоманды)
	Если ЭтоКомандаПоискаСотрудникаExpress(ИмяКоманды) Тогда
		Возврат "Express.Employee.Command";
	КонецЕсли;
	Если ЭтоКомандаКалендаряОтпускаExpress(ИмяКоманды) Тогда
		Возврат "Express.VacationDays.Calendar";
	КонецЕсли;
	Возврат "Express.VacationDays.Command";
КонецФункции

Функция КомандаОтпускаExpress()
	Возврат "/VacationDays";
КонецФункции

Функция КомандаПоискаСотрудникаExpress()
	Возврат "/Employee";
КонецФункции

Функция СценарийПоискаСотрудникаExpress()
	Возврат "EmployeeSearch";
КонецФункции

Функция ШагВводаФамилииСотрудникаExpress()
	Возврат "LastNameInput";
КонецФункции

Функция СрокОжиданияВводаФамилииСотрудникаExpress()
	Возврат 10 * 60;
КонецФункции

Функция ПрефиксКомандыКалендаряОтпускаExpress()
	Возврат "/VacationDaysCalendar";
КонецФункции

Функция СценарийВыбораДатыОтпускаExpress()
	Возврат "VacationDays";
КонецФункции

Функция ШагВыбораДатыОтпускаExpress()
	Возврат "ВыборДаты";
КонецФункции

Функция ПараметрыБазыПоСотруднику(Знач Сотрудник)
	ГоловнаяОрганизация = ПолучитьГоловнуюОрганизациюСотрудника(Сотрудник);
	КодОрганизации = КодОрганизацииEMS(ГоловнаяОрганизация);
	ПараметрыБазы = ПолучитьПараметрыБазыПоКодуОрганизации(КодОрганизации);
	Если ПараметрыБазы = Неопределено Тогда
		ВызватьИсключение СтрШаблон(
			"Не найдены параметры нижней базы EMS для организации '%1' с кодом '%2'.",
			ГоловнаяОрганизация,
			КодОрганизации);
	КонецЕсли;
	Возврат ПараметрыБазы;
КонецФункции

Функция ПолучитьГоловнуюОрганизациюСотрудника(Знач Сотрудник)
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	Сотрудники.ГоловнаяОрганизация КАК ГоловнаяОрганизация
		|ИЗ
		|	Справочник.Сотрудники КАК Сотрудники
		|ГДЕ
		|	Сотрудники.Ссылка = &Сотрудник";
	Запрос.УстановитьПараметр("Сотрудник", Сотрудник);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Не Выборка.Следующий() Или Не ЗначениеЗаполнено(Выборка.ГоловнаяОрганизация) Тогда
		ВызватьИсключение СтрШаблон("Для сотрудника '%1' не заполнена головная организация.", Сотрудник);
	КонецЕсли;
	Возврат Выборка.ГоловнаяОрганизация;
КонецФункции

Функция КодОрганизацииEMS(Знач Организация)
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	EMS_КодСопоставленияОрганизации.Code КАК КодОрганизации
		|ИЗ
		|	РегистрСведений.EMS_КодСопоставленияОрганизации КАК EMS_КодСопоставленияОрганизации
		|ГДЕ
		|	EMS_КодСопоставленияОрганизации.ГУИД = &ГУИД";
	Запрос.УстановитьПараметр("ГУИД", Строка(Организация.УникальныйИдентификатор()));
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() И ЗначениеЗаполнено(Выборка.КодОрганизации) Тогда
		Возврат Выборка.КодОрганизации;
	КонецЕсли;
	Возврат Организация.Код;
КонецФункции

Функция ПолучитьПараметрыБазыПоКодуОрганизации(Знач КодОрганизации)
	Если Не ЗначениеЗаполнено(КодОрганизации) Тогда
		ВызватьИсключение "Не определен код организации для выбора нижней базы EMS.";
	КонецЕсли;
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	EMS_ПараметрыБаз.Proxy КАК Proxy,
		|	EMS_ПараметрыБаз.SSL КАК SSL,
		|	EMS_ПараметрыБаз.WSИмяБазы КАК WSИмяБазы,
		|	EMS_ПараметрыБаз.WSИмяСервера КАК WSИмяСервера,
		|	EMS_ПараметрыБаз.КодОрганизации КАК КодОрганизации,
		|	EMS_ПараметрыБаз.НаименованиеУзлаИБ КАК НаименованиеУзлаИБ,
		|	EMS_ПараметрыБаз.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.EMS_ПараметрыБаз КАК EMS_ПараметрыБаз
		|ГДЕ
		|	EMS_ПараметрыБаз.КодОрганизации = &КодОрганизации
		|	И EMS_ПараметрыБаз.НаименованиеУзлаИБ <> """"
		|	И EMS_ПараметрыБаз.WSИмяБазы <> """"
		|	И EMS_ПараметрыБаз.WSИмяСервера <> """"";
	Запрос.УстановитьПараметр("КодОрганизации", КодОрганизации);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Не Выборка.Следующий() Тогда
		Возврат Неопределено;
	КонецЕсли;
	ПараметрыБазы = Новый Структура(
		"Proxy, SSL, WSИмяБазы, WSИмяСервера, КодОрганизации, НаименованиеУзлаИБ, Ссылка, WSИмяПользователя, WSПароль");
	ЗаполнитьЗначенияСвойств(ПараметрыБазы, Выборка);
	ПараметрыБазы.WSИмяПользователя = ОбщегоНазначения.ПрочитатьДанныеИзБезопасногоХранилища(
		"СинхронизацияEMS", "Логин");
	ПараметрыБазы.WSПароль = ОбщегоНазначения.ПрочитатьДанныеИзБезопасногоХранилища(
		"СинхронизацияEMS", "Пароль");
	Возврат ПараметрыБазы;
КонецФункции

Функция ВыполнитьЗапросДанныхExpress(Знач ПараметрыБазы, Знач ДанныеЗапроса)
	ПутьНаСервере = ПараметрыБазы.WSИмяБазы + "/hs/ems-express-data/V1/command";
	ЗаписатьЛогЗапросаНижнейБазыExpress("Запрос", ПараметрыБазы, ДанныеЗапроса, 0, "");
	Соединение = Новый HTTPСоединение(
		ПараметрыБазы.WSИмяСервера, , ПараметрыБазы.WSИмяПользователя, ПараметрыБазы.WSПароль);
	Заголовки = Новый Соответствие;
	Заголовки.Вставить("Content-Type", "application/json;charset=UTF-8");
	ЗапросHTTP = Новый HTTPЗапрос(ПутьНаСервере, Заголовки);
	ЗапросHTTP.УстановитьТелоИзСтроки(
		СтрокаJSON(ДанныеЗапроса), "UTF-8", ИспользованиеByteOrderMark.НеИспользовать);
	Ответ = Соединение.ОтправитьДляОбработки(ЗапросHTTP);
	ТекстОтвета = Ответ.ПолучитьТелоКакСтроку();
	ЗаписатьЛогЗапросаНижнейБазыExpress(
		"Ответ", ПараметрыБазы, ДанныеЗапроса, Ответ.КодСостояния, ТекстОтвета);
	ДанныеОтвета = ПрочитатьJSONИзСтроки(ТекстОтвета);
	Если Ответ.КодСостояния <> 200 Тогда
		ОписаниеОшибкиСервиса = ОписаниеОшибкиСервисаExpress(ДанныеОтвета);
		ВызватьИсключение СтрШаблон(
			"Нижняя база EMS вернула код %1. %2", Ответ.КодСостояния, ОписаниеОшибкиСервиса);
	КонецЕсли;
	Если Не ДанныеОтвета.Свойство("status") Или ДанныеОтвета.status <> "ok" Тогда
		ВызватьИсключение ОписаниеОшибкиСервисаExpress(ДанныеОтвета);
	КонецЕсли;
	Возврат Новый Структура(
		"КодСостояния, ТекстОтвета, ДанныеОтвета", Ответ.КодСостояния, ТекстОтвета, ДанныеОтвета);
КонецФункции

Функция ОписаниеОшибкиСервисаExpress(Знач ДанныеОтвета)
	Если ДанныеОтвета <> Неопределено
		И ТипЗнч(ДанныеОтвета) = Тип("Структура")
		И ДанныеОтвета.Свойство("message")
		И ЗначениеЗаполнено(ДанныеОтвета.message) Тогда
		Возврат ДанныеОтвета.message;
	КонецЕсли;
	Возврат "Ошибка получения данных Express из нижней базы.";
КонецФункции

Функция СтрокаJSON(Знач ДанныеJSON)
	ЗаписьJSON = Новый ЗаписьJSON;
	ЗаписьJSON.УстановитьСтроку();
	ЗаписатьJSON(ЗаписьJSON, ДанныеJSON);
	Возврат ЗаписьJSON.Закрыть();
КонецФункции

Функция ПрочитатьJSONИзСтроки(Знач ТекстJSON)
	ЧтениеJSON = Новый ЧтениеJSON;
	ЧтениеJSON.УстановитьСтроку(ТекстJSON);
	Результат = ПрочитатьJSON(ЧтениеJSON);
	ЧтениеJSON.Закрыть();
	Возврат Результат;
КонецФункции

Процедура ЗаписатьЛогКомандыExpress(Знач Этап, Знач ИмяКоманды, Знач ИдентификаторСинхронизации,
	Знач ИдентификаторЧата, Знач ИдентификаторБота, Знач Комментарий = "", Знач Уровень = Неопределено)
	Если Уровень = Неопределено Тогда
		Уровень = УровеньЖурналаРегистрации.Информация;
	КонецЕсли;
	ТекстКомментария = СтрШаблон(
		"Этап=%1; command=%2; sync_id=%3; chat=%4; bot_id=%5; %6",
		Этап,
		ИмяКоманды,
		?(ЗначениеЗаполнено(ИдентификаторСинхронизации), ИдентификаторСинхронизации, "<нет>"),
		ИдентификаторЧата,
		?(ЗначениеЗаполнено(ИдентификаторБота), ИдентификаторБота, "<нет>"),
		Комментарий);
	ЗаписьЖурналаРегистрации("Express.Command", Уровень, , , ТекстКомментария);
КонецПроцедуры

Процедура ЗаписатьЛогЗапросаНижнейБазыExpress(Знач Этап, Знач ПараметрыБазы, Знач ДанныеЗапроса,
	Знач КодСостояния, Знач ТекстОтвета)
	КодПредставление = ?(КодСостояния = 0, "<нет>", Формат(КодСостояния, "ЧГ="));
	Комментарий = СтрШаблон(
		"Этап=%1; База=%2; КодОрганизации=%3; command=%4; employee=%5; sync_id=%6; HTTP=%7; response=%8",
		Этап,
		ПараметрыБазы.НаименованиеУзлаИБ,
		ПараметрыБазы.КодОрганизации,
		ДанныеЗапроса.ИмяКоманды,
		ДанныеЗапроса.ИдентификаторСотрудника,
		?(ЗначениеЗаполнено(ДанныеЗапроса.sync_id), ДанныеЗапроса.sync_id, "<нет>"),
		КодПредставление,
		Лев(Строка(ТекстОтвета), 1000));
	Уровень = ?(
		КодСостояния <> 0 И КодСостояния <> 200,
		УровеньЖурналаРегистрации.Ошибка,
		УровеньЖурналаРегистрации.Информация);
	ЗаписьЖурналаРегистрации(
		"Express.LowerBaseRequest", Уровень, , ПараметрыБазы.Ссылка, Комментарий);
КонецПроцедуры

#КонецОбласти
